systems/centos/administration/boot.org
#+title: boot
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* boot sequence

=bios/uefi (ROM. POST) > device (hdd etc.) > mbr/gpt > grub2 > kernel > systemd (first process)=

* notes

- uefi. tpm - trusted platform module
- first stage grub2 is on mbr/gpt
- =/boot= is normally first partition.
- historically bios couldn't find bootloader unless in first 1024 cylinders
- MBR max 2TB per disk. GPT no limit
- only uefi can boot gpt
- grub2 e to edit, c to open command prompt
- edit grub2. e => ^linux16=
- add systemd.unit=emergency.target C-x ; to start emergency target
- type exit to return to default target (mutliuser or graphical target)
- =systemctl reboot=
- append =systemd.unit=name.target= to end of kernel command line
- =systemd.unit=multi-user.target=
- systemd.unit=rescue.target ; recovery shell
- systemd.unit=emergency.target ; no fs except root in ro
- init=/sysroot/bin/sh ; start shell, root in ro, no password required
  - or rd.break
- should password protect grub2 menu
- rhgb quiet ; red hat graphical boot

- /boot directory, initramfs filename of intial ram disk

- SELinux first starts in permissive mode, until the configured policy
  (enforcing) is loaded near the end of the boot process.

[[file:../centos.html][back]]
